zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/MKM35Z512VLL7-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MKM35Z512VLL7/signal_configuration.xml
 *
 * Copyright 2024, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef _ZEPHYR_DTS_BINDING_MKM35Z512VLL7_
#define _ZEPHYR_DTS_BINDING_MKM35Z512VLL7_

#define KINETIS_MUX(port, pin, mux)		\
	(((((port) - 'A') & 0xF) << 28) |	\
	(((pin) & 0x3F) << 22) |		\
	(((mux) & 0x7) << 8))

#define LCD_P23_PTA0 KINETIS_MUX('A',0,0) /* PTA_0 */
#define LLWU_P16_PTA0 KINETIS_MUX('A',0,1) /* PTA_0 */
#define PTA0 KINETIS_MUX('A',0,1) /* PTA_0 */
#define LCD_P23_Fault_PTA0 KINETIS_MUX('A',0,7) /* PTA_0 */
#define LCD_P24_PTA1 KINETIS_MUX('A',1,0) /* PTA_1 */
#define PTA1 KINETIS_MUX('A',1,1) /* PTA_1 */
#define LCD_P24_Fault_PTA1 KINETIS_MUX('A',1,7) /* PTA_1 */
#define LCD_P25_PTA2 KINETIS_MUX('A',2,0) /* PTA_2 */
#define PTA2 KINETIS_MUX('A',2,1) /* PTA_2 */
#define LCD_P25_Fault_PTA2 KINETIS_MUX('A',2,7) /* PTA_2 */
#define LCD_P26_PTA3 KINETIS_MUX('A',3,0) /* PTA_3 */
#define PTA3 KINETIS_MUX('A',3,1) /* PTA_3 */
#define LCD_P26_Fault_PTA3 KINETIS_MUX('A',3,7) /* PTA_3 */
#define LCD_P27_PTA4 KINETIS_MUX('A',4,0) /* PTA_4 */
#define LLWU_P15_PTA4 KINETIS_MUX('A',4,1) /* PTA_4 */
#define PTA4 KINETIS_MUX('A',4,1) /* PTA_4 */
#define LCD_P27_Fault_PTA4 KINETIS_MUX('A',4,6) /* PTA_4 */
#define NMI_b_PTA4 KINETIS_MUX('A',4,7) /* PTA_4 */
#define LCD_P28_PTA5 KINETIS_MUX('A',5,0) /* PTA_5 */
#define PTA5 KINETIS_MUX('A',5,1) /* PTA_5 */
#define CMP0_OUT_PTA5 KINETIS_MUX('A',5,2) /* PTA_5 */
#define LCD_P28_Fault_PTA5 KINETIS_MUX('A',5,7) /* PTA_5 */
#define LCD_P29_PTA6 KINETIS_MUX('A',6,0) /* PTA_6 */
#define PTA6 KINETIS_MUX('A',6,1) /* PTA_6 */
#define LLWU_P14_PTA6 KINETIS_MUX('A',6,1) /* PTA_6 */
#define XBAR_IN0_PTA6 KINETIS_MUX('A',6,2) /* PTA_6 */
#define XBAR_IN0_PTA6_PTA6_PTA6_PTA6 KINETIS_MUX('A',6,2) /* PTA_6 */
#define XBAR_IN0_PTA6_PTA6 KINETIS_MUX('A',6,2) /* PTA_6 */
#define LCD_P29_Fault_PTA6 KINETIS_MUX('A',6,7) /* PTA_6 */
#define LCD_P30_PTA7 KINETIS_MUX('A',7,0) /* PTA_7 */
#define PTA7 KINETIS_MUX('A',7,1) /* PTA_7 */
#define XBAR_OUT0_PTA7 KINETIS_MUX('A',7,2) /* PTA_7 */
#define LCD_P30_Fault_PTA7 KINETIS_MUX('A',7,7) /* PTA_7 */
#define LCD_P31_PTB0 KINETIS_MUX('B',0,0) /* PTB_0 */
#define PTB0 KINETIS_MUX('B',0,1) /* PTB_0 */
#define LCD_P31_Fault_PTB0 KINETIS_MUX('B',0,7) /* PTB_0 */
#define LCD_P32_PTB1 KINETIS_MUX('B',1,0) /* PTB_1 */
#define PTB1 KINETIS_MUX('B',1,1) /* PTB_1 */
#define LLWU_P17_PTB1 KINETIS_MUX('B',1,1) /* PTB_1 */
#define LCD_P32_Fault_PTB1 KINETIS_MUX('B',1,7) /* PTB_1 */
#define LCD_P33_PTB2 KINETIS_MUX('B',2,0) /* PTB_2 */
#define PTB2 KINETIS_MUX('B',2,1) /* PTB_2 */
#define SPI2_PCS0_PTB2 KINETIS_MUX('B',2,2) /* PTB_2 */
#define LCD_P33_Fault_PTB2 KINETIS_MUX('B',2,7) /* PTB_2 */
#define LCD_P34_PTB3 KINETIS_MUX('B',3,0) /* PTB_3 */
#define PTB3 KINETIS_MUX('B',3,1) /* PTB_3 */
#define SPI2_SCK_PTB3 KINETIS_MUX('B',3,2) /* PTB_3 */
#define LCD_P34_Fault_PTB3 KINETIS_MUX('B',3,7) /* PTB_3 */
#define LCD_P35_PTB4 KINETIS_MUX('B',4,0) /* PTB_4 */
#define PTB4 KINETIS_MUX('B',4,1) /* PTB_4 */
#define SPI2_MISO_PTB4 KINETIS_MUX('B',4,2) /* PTB_4 */
#define LCD_P35_Fault_PTB4 KINETIS_MUX('B',4,7) /* PTB_4 */
#define LCD_P36_PTB5 KINETIS_MUX('B',5,0) /* PTB_5 */
#define PTB5 KINETIS_MUX('B',5,1) /* PTB_5 */
#define SPI2_MOSI_PTB5 KINETIS_MUX('B',5,2) /* PTB_5 */
#define LCD_P36_Fault_PTB5 KINETIS_MUX('B',5,7) /* PTB_5 */
#define LCD_P37_PTB6 KINETIS_MUX('B',6,0) /* PTB_6 */
#define CMP1_IN0_PTB6 KINETIS_MUX('B',6,0) /* PTB_6 */
#define PTB6 KINETIS_MUX('B',6,1) /* PTB_6 */
#define LCD_P37_Fault_PTB6 KINETIS_MUX('B',6,7) /* PTB_6 */
#define LCD_P38_PTB7 KINETIS_MUX('B',7,0) /* PTB_7 */
#define PTB7 KINETIS_MUX('B',7,1) /* PTB_7 */
#define AFE_CLK_PTB7 KINETIS_MUX('B',7,2) /* PTB_7 */
#define LCD_P38_Fault_PTB7 KINETIS_MUX('B',7,7) /* PTB_7 */
#define LCD_P39_PTC0 KINETIS_MUX('C',0,0) /* PTC_0 */
#define PTC0 KINETIS_MUX('C',0,1) /* PTC_0 */
#define UART3_RTS_b_PTC0 KINETIS_MUX('C',0,2) /* PTC_0 */
#define XBAR_IN1_PTC0 KINETIS_MUX('C',0,3) /* PTC_0 */
#define XBAR_IN1_PTC0_PTC0 KINETIS_MUX('C',0,3) /* PTC_0 */
#define XBAR_IN1_PTC0_PTC0_PTC0_PTC0 KINETIS_MUX('C',0,3) /* PTC_0 */
#define PDB0_EXTRG_PTC0 KINETIS_MUX('C',0,4) /* PTC_0 */
#define LCD_P39_Fault_PTC0 KINETIS_MUX('C',0,7) /* PTC_0 */
#define CMP1_IN1_PTC1 KINETIS_MUX('C',1,0) /* PTC_1 */
#define LCD_P40_PTC1 KINETIS_MUX('C',1,0) /* PTC_1 */
#define PTC1 KINETIS_MUX('C',1,1) /* PTC_1 */
#define UART3_CTS_b_PTC1 KINETIS_MUX('C',1,2) /* PTC_1 */
#define LCD_P40_Fault_PTC1 KINETIS_MUX('C',1,7) /* PTC_1 */
#define LCD_P41_PTC2 KINETIS_MUX('C',2,0) /* PTC_2 */
#define PTC2 KINETIS_MUX('C',2,1) /* PTC_2 */
#define UART3_TX_PTC2 KINETIS_MUX('C',2,2) /* PTC_2 */
#define XBAR_OUT1_PTC2 KINETIS_MUX('C',2,3) /* PTC_2 */
#define LCD_P41_Fault_PTC2 KINETIS_MUX('C',2,7) /* PTC_2 */
#define CMP0_IN3_PTC3 KINETIS_MUX('C',3,0) /* PTC_3 */
#define LCD_P42_PTC3 KINETIS_MUX('C',3,0) /* PTC_3 */
#define LLWU_P13_PTC3 KINETIS_MUX('C',3,1) /* PTC_3 */
#define PTC3 KINETIS_MUX('C',3,1) /* PTC_3 */
#define UART3_RX_PTC3 KINETIS_MUX('C',3,2) /* PTC_3 */
#define LCD_P42_Fault_PTC3 KINETIS_MUX('C',3,7) /* PTC_3 */
#define LCD_P43_PTC4 KINETIS_MUX('C',4,0) /* PTC_4 */
#define PTC4 KINETIS_MUX('C',4,1) /* PTC_4 */
#define LCD_P43_Fault_PTC4 KINETIS_MUX('C',4,7) /* PTC_4 */
#define ADC0_SE0_PTC5 KINETIS_MUX('C',5,0) /* PTC_5 */
#define CMP2_IN0_PTC5 KINETIS_MUX('C',5,0) /* PTC_5 */
#define PTC5 KINETIS_MUX('C',5,1) /* PTC_5 */
#define LLWU_P12_PTC5 KINETIS_MUX('C',5,1) /* PTC_5 */
#define UART0_RTS_b_PTC5 KINETIS_MUX('C',5,2) /* PTC_5 */
#define LPTMR1_ALT1_PTC5 KINETIS_MUX('C',5,4) /* PTC_5 */
#define ADC0_SE1_PTC6 KINETIS_MUX('C',6,0) /* PTC_6 */
#define CMP2_IN1_PTC6 KINETIS_MUX('C',6,0) /* PTC_6 */
#define PTC6 KINETIS_MUX('C',6,1) /* PTC_6 */
#define UART0_CTS_b_PTC6 KINETIS_MUX('C',6,2) /* PTC_6 */
#define QTMR0_TMR1_PTC6 KINETIS_MUX('C',6,3) /* PTC_6 */
#define PDB0_EXTRG_PTC6 KINETIS_MUX('C',6,4) /* PTC_6 */
#define CMP2_IN2_PTC7 KINETIS_MUX('C',7,0) /* PTC_7 */
#define ADC0_SE2_PTC7 KINETIS_MUX('C',7,0) /* PTC_7 */
#define PTC7 KINETIS_MUX('C',7,1) /* PTC_7 */
#define UART0_TX_PTC7 KINETIS_MUX('C',7,2) /* PTC_7 */
#define XBAR_OUT2_PTC7 KINETIS_MUX('C',7,3) /* PTC_7 */
#define CMP0_IN0_PTD0 KINETIS_MUX('D',0,0) /* PTD_0 */
#define PTD0 KINETIS_MUX('D',0,1) /* PTD_0 */
#define LLWU_P11_PTD0 KINETIS_MUX('D',0,1) /* PTD_0 */
#define XBAR_IN2_PTD0 KINETIS_MUX('D',0,3) /* PTD_0 */
#define XBAR_IN2_PTD0_PTD0_PTD0_PTD0 KINETIS_MUX('D',0,3) /* PTD_0 */
#define XBAR_IN2_PTD0_PTD0 KINETIS_MUX('D',0,3) /* PTD_0 */
#define UART0_RX/XBAR_IN2_PTD0_PTD0 KINETIS_MUX('D',0,3) /* PTD_0 */
#define PTD1 KINETIS_MUX('D',1,1) /* PTD_1 */
#define UART1_TX_PTD1 KINETIS_MUX('D',1,2) /* PTD_1 */
#define SPI0_PCS0_PTD1 KINETIS_MUX('D',1,3) /* PTD_1 */
#define XBAR_OUT3_PTD1 KINETIS_MUX('D',1,4) /* PTD_1 */
#define QTMR0_TMR3_PTD1 KINETIS_MUX('D',1,5) /* PTD_1 */
#define CMP0_IN1_PTD2 KINETIS_MUX('D',2,0) /* PTD_2 */
#define PTD2 KINETIS_MUX('D',2,1) /* PTD_2 */
#define LLWU_P10_PTD2 KINETIS_MUX('D',2,1) /* PTD_2 */
#define SPI0_SCK_PTD2 KINETIS_MUX('D',2,3) /* PTD_2 */
#define XBAR_IN3_PTD2 KINETIS_MUX('D',2,4) /* PTD_2 */
#define XBAR_IN3_PTD2_PTD2 KINETIS_MUX('D',2,4) /* PTD_2 */
#define XBAR_IN3_PTD2_PTD2_PTD2_PTD2 KINETIS_MUX('D',2,4) /* PTD_2 */
#define UART1_RX/XBAR_IN3_PTD2_PTD2 KINETIS_MUX('D',2,4) /* PTD_2 */
#define PTD3 KINETIS_MUX('D',3,1) /* PTD_3 */
#define UART1_CTS_b_PTD3 KINETIS_MUX('D',3,2) /* PTD_3 */
#define SPI0_MOSI_PTD3 KINETIS_MUX('D',3,3) /* PTD_3 */
#define LPTMR1_ALT2_PTD3 KINETIS_MUX('D',3,4) /* PTD_3 */
#define ADC0_SE3_PTD4 KINETIS_MUX('D',4,0) /* PTD_4 */
#define PTD4 KINETIS_MUX('D',4,1) /* PTD_4 */
#define LLWU_P9_PTD4 KINETIS_MUX('D',4,1) /* PTD_4 */
#define UART1_RTS_b_PTD4 KINETIS_MUX('D',4,2) /* PTD_4 */
#define SPI0_MISO_PTD4 KINETIS_MUX('D',4,3) /* PTD_4 */
#define LPTMR1_ALT3_PTD4 KINETIS_MUX('D',4,4) /* PTD_4 */
#define ADC0_SE4a_PTD5 KINETIS_MUX('D',5,0) /* PTD_5 */
#define PTD5 KINETIS_MUX('D',5,1) /* PTD_5 */
#define LPTMR0_ALT3_PTD5 KINETIS_MUX('D',5,2) /* PTD_5 */
#define QTMR0_TMR0_PTD5 KINETIS_MUX('D',5,3) /* PTD_5 */
#define UART3_CTS_b_PTD5 KINETIS_MUX('D',5,4) /* PTD_5 */
#define ADC0_SE5a_PTD6 KINETIS_MUX('D',6,0) /* PTD_6 */
#define PTD6 KINETIS_MUX('D',6,1) /* PTD_6 */
#define LLWU_P8_PTD6 KINETIS_MUX('D',6,1) /* PTD_6 */
#define LPTMR0_ALT2_PTD6 KINETIS_MUX('D',6,2) /* PTD_6 */
#define CMP1_OUT_PTD6 KINETIS_MUX('D',6,3) /* PTD_6 */
#define UART3_RTS_b_PTD6 KINETIS_MUX('D',6,4) /* PTD_6 */
#define CMP0_IN4_PTD7 KINETIS_MUX('D',7,0) /* PTD_7 */
#define LLWU_P7_PTD7 KINETIS_MUX('D',7,1) /* PTD_7 */
#define PTD7 KINETIS_MUX('D',7,1) /* PTD_7 */
#define I2C0_SCL_PTD7 KINETIS_MUX('D',7,2) /* PTD_7 */
#define XBAR_IN4_PTD7_PTD7_PTD7_PTD7 KINETIS_MUX('D',7,3) /* PTD_7 */
#define XBAR_IN4/UART3_RX_PTD7_PTD7 KINETIS_MUX('D',7,3) /* PTD_7 */
#define XBAR_IN4_PTD7 KINETIS_MUX('D',7,3) /* PTD_7 */
#define XBAR_IN4_PTD7_PTD7 KINETIS_MUX('D',7,3) /* PTD_7 */
#define PTE0 KINETIS_MUX('E',0,1) /* PTE_0 */
#define I2C0_SDA_PTE0 KINETIS_MUX('E',0,2) /* PTE_0 */
#define XBAR_OUT4_PTE0 KINETIS_MUX('E',0,3) /* PTE_0 */
#define UART3_TX_PTE0 KINETIS_MUX('E',0,4) /* PTE_0 */
#define CLKOUT_PTE0 KINETIS_MUX('E',0,5) /* PTE_0 */
#define PTE1 KINETIS_MUX('E',1,1) /* PTE_1 */
#define RESET_b_PTE1 KINETIS_MUX('E',1,7) /* PTE_1 */
#define EXTAL_PTE2 KINETIS_MUX('E',2,0) /* PTE_2 */
#define PTE2 KINETIS_MUX('E',2,1) /* PTE_2 */
#define XBAR_IN6_PTE2 KINETIS_MUX('E',2,3) /* PTE_2 */
#define XBAR_IN6_PTE2_PTE2_PTE2_PTE2 KINETIS_MUX('E',2,3) /* PTE_2 */
#define EWM_IN/XBAR_IN6_PTE2_PTE2 KINETIS_MUX('E',2,3) /* PTE_2 */
#define XBAR_IN6_PTE2_PTE2 KINETIS_MUX('E',2,3) /* PTE_2 */
#define I2C1_SDA_PTE2 KINETIS_MUX('E',2,4) /* PTE_2 */
#define XTAL_PTE3 KINETIS_MUX('E',3,0) /* PTE_3 */
#define PTE3 KINETIS_MUX('E',3,1) /* PTE_3 */
#define EWM_OUT_b_PTE3 KINETIS_MUX('E',3,2) /* PTE_3 */
#define AFE_CLK_PTE3 KINETIS_MUX('E',3,3) /* PTE_3 */
#define I2C1_SCL_PTE3 KINETIS_MUX('E',3,4) /* PTE_3 */
#define PTE4 KINETIS_MUX('E',4,1) /* PTE_4 */
#define LPTMR0_ALT1_PTE4 KINETIS_MUX('E',4,2) /* PTE_4 */
#define UART2_CTS_b_PTE4 KINETIS_MUX('E',4,3) /* PTE_4 */
#define EWM_IN_PTE4 KINETIS_MUX('E',4,4) /* PTE_4 */
#define LLWU_P6_PTE5 KINETIS_MUX('E',5,1) /* PTE_5 */
#define PTE5 KINETIS_MUX('E',5,1) /* PTE_5 */
#define QTMR0_TMR3_PTE5 KINETIS_MUX('E',5,2) /* PTE_5 */
#define UART2_RTS_b_PTE5 KINETIS_MUX('E',5,3) /* PTE_5 */
#define EWM_OUT_b_PTE5 KINETIS_MUX('E',5,4) /* PTE_5 */
#define CMP0_IN2_PTE6 KINETIS_MUX('E',6,0) /* PTE_6 */
#define PTE6 KINETIS_MUX('E',6,1) /* PTE_6 */
#define LLWU_P5_PTE6 KINETIS_MUX('E',6,1) /* PTE_6 */
#define XBAR_IN5_PTE6 KINETIS_MUX('E',6,2) /* PTE_6 */
#define XBAR_IN5/UART2_RX_PTE6_PTE6 KINETIS_MUX('E',6,2) /* PTE_6 */
#define XBAR_IN5_PTE6_PTE6 KINETIS_MUX('E',6,2) /* PTE_6 */
#define XBAR_IN5_PTE6_PTE6_PTE6_PTE6 KINETIS_MUX('E',6,2) /* PTE_6 */
#define I2C0_SCL_PTE6 KINETIS_MUX('E',6,5) /* PTE_6 */
#define SWD_DIO_PTE6 KINETIS_MUX('E',6,7) /* PTE_6 */
#define ADC0_SE6a_PTE7 KINETIS_MUX('E',7,0) /* PTE_7 */
#define PTE7 KINETIS_MUX('E',7,1) /* PTE_7 */
#define XBAR_OUT5_PTE7 KINETIS_MUX('E',7,2) /* PTE_7 */
#define UART2_TX_PTE7 KINETIS_MUX('E',7,3) /* PTE_7 */
#define I2C0_SDA_PTE7 KINETIS_MUX('E',7,5) /* PTE_7 */
#define SWD_CLK_PTE7 KINETIS_MUX('E',7,7) /* PTE_7 */
#endif
